"""Переменные и типы данных"""

# переменная хранит определенные данные

name = 'Коля'
# в Python применяютмся 2 типа наименнования переменных
# camel case
userName = 'Коля'

# underscore notation
user_name = 'Коля'

"""
boolean - логическое значение True или False
int - целое число 1б   5б 14567
float - число с плавающей точкой 1,3    564,7678
complex - комплексные числа
str - строки   'hello' или "hello"
bytes - последовательность чисел в диапазоне 0-255
byte array - массив байтов
list - список
tuple - кортеж
set - неупорядоченная коллекция уникальных объектов
frozen set - то же самое, что и set, только не может изменяться (immutable)
dict - словарь, где каждый элемент имеет ключ и значение
"""

# с помощью функции type() динамически можно узнать текущий тип переменной
user_id = 12

print(type(user_name))
print(type(user_id))













